In [1]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [2]:
#Q1. Write a code to print the data present in the second row of the dataframe, df.
df['duration']

0    2
1    3
2    6
3    4
Name: duration, dtype: int64

In [3]:
#Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?
#The function . loc is typically used for label indexing and can access multiple columns, while . iloc is used for integer indexing

In [4]:
#Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df  then find the output for both new_df.loc[2] and new_df.iloc[2].

In [5]:
new_df=df.reindex([3,0,1,2])

new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [6]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [7]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [8]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [9]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.076418  0.246650  0.037071  0.837626  0.156684  0.284749
2  0.932931  0.964913  0.017802  0.661422  0.627587  0.828134
3  0.267569  0.410451  0.720307  0.231475  0.374241  0.888552
4  0.695993  0.636078  0.541610  0.898245  0.310094  0.957187
5  0.803013  0.224583  0.297866  0.059077  0.824795  0.709229
6  0.038842  0.587855  0.480728  0.606894  0.297158  0.575107

In [10]:
#(i) mean of each and every column present in the dataframe.
df1[columns].mean()

column_1    0.469128
column_2    0.511755
column_3    0.349231
column_4    0.549123
column_5    0.431760
column_6    0.707160
dtype: float64

In [11]:
#(ii) standard deviation of column, ‘column_2’
df1['column_2'].std()

0.27914543762539196

In [19]:
#Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2.
df1.at[2, 'column_2'] = 'your_string_variable'
df1

   column_1              column_2  column_3  column_4  column_5  column_6
1  0.624822              0.248715  0.026150  0.048434  0.584023  0.782240
2  0.778922  your_string_variable  0.016915  0.821932  0.537530  0.956623
3  0.713931              0.000193  0.322541  0.259043  0.285841  0.793183
4  0.789102              0.029229  0.419114  0.218486  0.421242  0.110569
5  0.339693              0.006012  0.602970  0.288414  0.570674  0.460055
6  0.591484              0.919085  0.807757  0.722971  0.719895  0.475539

In [20]:
#q6. what do you understand about the windows function in pandas and list the types of windows functions?
#A window function executes a calculation across a related set of table rows to the current row. It is also called SQL analytic function. It uses values from one or different rows to return a value for each row. A distinct feature of a window function is the OVER clause.

In [26]:
#Q7. Write a code to print only the current month and year at the time of answering this question.
from datetime import datetime
 
current_date = datetime.now()
 
current_month = current_date.strftime('%B')  
current_year = current_date.strftime('%Y')   

print(f"Current Month: {current_month}")
print(f"Current Year: {current_year}")

Current Month: November
Current Year: 2023

In [30]:
#Q8 Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.
import pandas as pd

date1_str = input("Enter the first date (YYYY-MM-DD): ")
date2_str = input("Enter the second date (YYYY-MM-DD): ")

date1 = pd.to_datetime(date1_str, format='%Y-%m-%d')
date2 = pd.to_datetime(date2_str, format='%Y-%m-%d')

time_difference = date2 - date1

days = time_difference.days
hours, remainder = divmod(time_difference.seconds, 3600)
minutes = remainder // 60

print(f"Time Difference:")
print(f"Days: {days} days")
print(f"Hours: {hours} hours")
print(f"Minutes: {minutes} minutes")

Enter the first date (YYYY-MM-DD): 2023-05-13
Enter the second date (YYYY-MM-DD): 2023-05-30
Time Difference:
Days: 17 days
Hours: 0 hours
Minutes: 0 minutes